In [1]:
import pandas as pd

In [12]:
# creating a simple dataframe

df = pd.DataFrame({'name': ['Jon','Tom','Jane','Kate'],
           'age': [35,20,28,55],
           'sex':['male','male','female','female']})

In [13]:
df

   name  age     sex
0   Jon   35    male
1   Tom   20    male
2  Jane   28  female
3  Kate   55  female

In [14]:
data = []

# always inserting new rows at the first position - last row will be always on top    
data.insert(0, {'name': 'Alex', 'age': 45, 'sex': 'male'})

# Concatanating original dataframe with additional row of data from list

pd.concat([pd.DataFrame(data), df], ignore_index=True) # does not save changes to the original dataframe

df2 = pd.concat([pd.DataFrame(data), df], ignore_index=True)

df2

   name  age     sex
0  Alex   45    male
1   Jon   35    male
2   Tom   20    male
3  Jane   28  female
4  Kate   55  female

In [16]:
# remember that df was not modified by code above. Record for Alex was added to df2

# another way of adding a row to the top of Pandas dataframe
df2.loc[-1] = ['Dean', '25', 'male']  # adding a row
df2.index = df2.index + 1  # shifting index
df2.sort_index(inplace=True)

In [17]:
df2

   name age     sex
0  Dean  25    male
1  Alex  45    male
2   Jon  35    male
3   Tom  20    male
4  Jane  28  female
5  Kate  55  female

In [22]:
df3 = pd.DataFrame([['Olivia',32,'female']], columns=['name','age','sex'])
df4 = pd.concat([df3, df2]).reset_index(drop=True)
df4

     name age     sex
0  Olivia  32  female
1    Dean  25    male
2    Alex  45    male
3     Jon  35    male
4     Tom  20    male
5    Jane  28  female
6    Kate  55  female

In [32]:
# creating a simple dataframe

df = pd.DataFrame({'name': ['Olivia','Dean','Alex','Jon','Tom','Jane','Kate'],
           'age': [32,23,45,35,20,28,55],
           'sex':['female', 'male','male','male','male','female','female']})
df

     name  age     sex
0  Olivia   32  female
1    Dean   23    male
2    Alex   45    male
3     Jon   35    male
4     Tom   20    male
5    Jane   28  female
6    Kate   55  female

In [24]:
# Let’s access cell value with index 2 and Column age

df.at[2,'age']

45

In [25]:
# Now let's update this value 

df.at[2,'age']=40

df

     name  age     sex
0  Olivia   32  female
1    Dean   23    male
2    Alex   40    male
3     Jon   35    male
4     Tom   20    male
5    Jane   28  female
6    Kate   55  female

In [30]:
# Let’s access cell value with index 2 and Column age after the change

df.at[2,'age']

40

In [26]:
# Let’s access cell value with index 1 and Column age
df.loc[1].at['age']

23

In [33]:
# Let’s access cell value with index 1 and Column age
df.loc[1].age

23

In [28]:
# let's try changing the value from 23 to 22 and see if df gets modified 
df.loc[1].at['age']=22
df

     name  age     sex
0  Olivia   32  female
1    Dean   23    male
2    Alex   40    male
3     Jon   35    male
4     Tom   20    male
5    Jane   28  female
6    Kate   55  female

In [29]:
df.loc[1].age = 22
df

/usr/local/lib/python3.7/dist-packages/pandas/core/generic.py:5168: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

     name  age     sex
0  Olivia   32  female
1    Dean   23    male
2    Alex   40    male
3     Jon   35    male
4     Tom   20    male
5    Jane   28  female
6    Kate   55  female

In [35]:
# Let’s access cell value with index 1 and Column age (column index 1)
df.iat[1, 1]

23

In [36]:
# Now let's update this value 

df.iat[1, 1]=22
df

     name  age     sex
0  Olivia   32  female
1    Dean   22    male
2    Alex   45    male
3     Jon   35    male
4     Tom   20    male
5    Jane   28  female
6    Kate   55  female